src/sfun.org
# -*- Mode:Org; Coding:utf-8; fill-column:158 -*-
#+TITLE:       free42 Simple Math Functions
#+AUTHOR:      Mitch Richling
#+EMAIL:       http://www.mitchr.me/
#+DATE:        2021-04-30
#+DESCRIPTION: Some simple math stuff for free42
#+LANGUAGE:    en
#+OPTIONS:     num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t skip:nil d:nil todo:t pri:nil H:5 p:t author:t html-scripts:nil
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <style>body { width: 95%; margin: 2% auto; font-size: 18px; line-height: 1.4em; font-family: Georgia, serif; color: black; background-color: white; }</style>
#+HTML_HEAD: <style>body { min-width: 500px; max-width: 1024px; }</style>
#+HTML_HEAD: <style>h1,h2,h3,h4,h5,h6 { color: #A5573E; line-height: 1em; font-family: Helvetica, sans-serif; }</style>
#+HTML_HEAD: <style>h1,h2,h3 { line-height: 1.4em; }</style>
#+HTML_HEAD: <style>h1.title { font-size: 3em; }</style>
#+HTML_HEAD: <style>h4,h5,h6 { font-size: 1em; }</style>
#+HTML_HEAD: <style>.org-src-container { border: 1px solid #ccc; box-shadow: 3px 3px 3px #eee; font-family: Lucida Console, monospace; font-size: 80%; margin: 0px; padding: 0px 0px; position: relative; }</style>
#+HTML_HEAD: <style>.org-src-container>pre { line-height: 1.2em; padding-top: 1.5em; margin: 0.5em; background-color: #404040; color: white; overflow: auto; }</style>
#+HTML_HEAD: <style>.org-src-container>pre:before { display: block; position: absolute; background-color: #b3b3b3; top: 0; right: 0; padding: 0 0.2em 0 0.4em; border-bottom-left-radius: 8px; border: 0; color: white; font-size: 100%; font-family: Helvetica, sans-serif;}</style>
#+HTML_HEAD: <style>pre.example { white-space: pre-wrap; white-space: -moz-pre-wrap; white-space: -o-pre-wrap; font-family: Lucida Console, monospace; font-size: 80%; background: #404040; color: white; display: block; padding: 0em; border: 2px solid black; }</style>
#+HTML_LINK_HOME: https://www.mitchr.me/
#+HTML_LINK_UP: https://richmit.github.io/hp42/
#+EXPORT_FILE_NAME: ../docs/sfun
#+LATEX_HEADER: \usepackage{extsizes} 
#+LATEX_HEADER: \usepackage[landscape,margin=0.5in]{geometry}
#+LATEX_HEADER: \usepackage{mathabx}
#+LATEX_HEADER: \usepackage{boisik}
#+LATEX_CLASS_OPTIONS: [letterpaper, 8pt]
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \DeclareUnicodeCharacter{028F}{\textsc{Y}}
#+LATEX_HEADER: \DeclareUnicodeCharacter{03A3}{$\Sigma$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{03BC}{$\mu$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{03C0}{\pi}
#+LATEX_HEADER: \DeclareUnicodeCharacter{1D07}{$\bagmember$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{21B5}{$\dlsh$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{221A}{\makebox[.5em]{$\sqrt{}$}}
#+LATEX_HEADER: \DeclareUnicodeCharacter{2221}{$\measuredangle$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{222B}{$\int$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{2260}{$\neq$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{2264}{$\leq$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{2265}{$\geq$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{251C}{$\vdash$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{2592}{$\square$}
#+LATEX_HEADER: \DeclareUnicodeCharacter{25B8}{$\blacktriangleright$}

#+ATTR_HTML: :border 2 solid #ccc :frame hsides :align center
|          <r> | <l>                                          |
|    *Author:* | /{{{author}}}/                               |
|   *Updated:* | /{{{modification-time(%Y-%m-%d %H:%M:%S)}}}/ |
#+ATTR_HTML: :align center
Copyright {{{time(%Y)}}} Mitch Richling. All rights reserved.

#+TOC: headlines 5

#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#   00   #    10   #    20   #    30   #    40   #    50   #    60   #    70   #    80   #    90   #   100   #   110   #   120   #   130   #   140   #   150   #   160   #
# 234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #
#        #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #         #

# Provde links to programs like this: https://richmit.github.io/hp42/sfun.html#coderef-lnXY

* Metadata

The home for this HTML file is: https://richmit.github.io/hp42/sfun.html

Files related to this document may be found on github: https://github.com/richmit/hp42

Directory contents:
#+ATTR_HTML: :border 0 :frame none :rules none :align center
   | =src=     | - | The org-mode file that generated this HTML document            |
   | =src_42s= | - | Ready to convert source listings for 42s code in this document |
   | =docs=    | - | This html document and associated PDF                          |
   | =bin=     | - | Importable RAW program files                                   |

* Introduction
:PROPERTIES:
:CUSTOM_ID: introduction
:END:

This org-mode file collects together a handful simple mathematical functions that I find useful.  

