src/sfun.org
* =SFUN= Menu
:PROPERTIES:
:CUSTOM_ID: menu-sfun
:END:

#+ATTR_LATEX: :environment longtable
#+ATTR_HTML: :align center :frame box :rules all
#+NAME:SFUN
| Menu       |        | Description                                                                |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| L&P:lnYX   | lnYX   | Base Y Logarithm of X                                                      |                  |                 |
| L&P:▒▒▒▒   |        |                                                                            |                  |                 |
| L&P:ln2    | ln2    | Base 2 logarithm                                                           |                  |                 |
| L&P:LN     |        | Base 3 logarithm                                                           |                  |                 |
| L&P:LOG    |        | Base 10 logarithm                                                          |                  |                 |
| L&P:▒▒▒▒   |        |                                                                            |                  |                 |
| L&P:Y↑X    |        | Raise Y to the power of X                                                  |                  |                 |
| L&P:▒▒▒▒   |        |                                                                            |                  |                 |
| L&P:2↑X    | LBL 58 | Raise 2 to the power of X                                                  |                  |                 |
| L&P:E↑X    |        | Raise e to the power of X                                                  |                  |                 |
| L&P:10↑X   |        | Raise 10 to the power of X                                                 |                  |                 |
| L&P:▒▒▒▒   |        |                                                                            |                  |                 |
| L&P:Y√X    | YROOT  | Yth roots prefering real & pure imaginary answers                          |                  |                 |
| L&P:▒▒▒▒   |        |                                                                            |                  |                 |
| L&P:2√X    | LBL 57 | Square root prefering real & pure imaginary answers                        |                  |                 |
| L&P:3√X    | LBL 56 | Cube root prefering real & pure imaginary answers                          |                  |                 |
| L&P:5√X    | LBL 55 | Fifth root prefering real & pure imaginary answers                         |                  |                 |
| L&P:7√X    | LBL 54 | Seventh root prefering real & pure imaginary answers                       |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| CPLX:RPART |        | Real Part of anumber or matrix                                             |                  |                 |
| CPLX:IPART |        | Imaginary Part of a number or matrix                                       |                  |                 |
| CPLX:CONJ  |        | Complex conjugate of a number or matrix                                    |                  |                 |
| CPLX:CABS  |        | Magnitude of a number or matrix (built in =ABS= fails on a complex matrix) |                  |                 |
| CPLX:CARG  |        | Complex argument of a number or matrix                                     |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| TRIG:SIN   |        |                                                                            |                  |                 |
| TRIG:COS   |        |                                                                            |                  |                 |
| TRIG:TAN   |        |                                                                            |                  |                 |
| TRIG:ASIN  |        |                                                                            |                  |                 |
| TRIG:ACOS  |        |                                                                            |                  |                 |
| TRIG:ATAN  |        |                                                                            |                  |                 |
| TRIG:CSC   |        | 1/SIN(X)                                                                   |                  |                 |
| TRIG:SEC   |        | 1/COS(X)                                                                   |                  |                 |
| TRIG:COT   |        | 1/TAN(X)                                                                   |                  |                 |
| TRIG:ACSC  |        | SIN(1/X)                                                                   |                  |                 |
| TRIG:ASEC  |        | COS(1/X)                                                                   |                  |                 |
| TRIG:ACOT  |        | TAN(1/X)                                                                   |                  |                 |
| TRIG:TAN2  |        |                                                                            |                  |                 |
| TRIG:HYPOT |        |                                                                            |                  |                 |
| TRIG:HAV   |        | Haversine = 1/2-cos(X)/2                                                   |                  |                 |
| TRIG:AHAV  |        | Inverse Haversine = 2*asin(sqrt(X))                                        |                  |                 |
| TRIG:▒▒▒▒  |        |                                                                            |                  |                 |
| TRIG:▒▒▒▒  |        |                                                                            |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| HYP:SINH   |        |                                                                            |                  |                 |
| HYP:COSH   |        |                                                                            |                  |                 |
| HYP:TANH   |        |                                                                            |                  |                 |
| HYP:ASINH  |        |                                                                            |                  |                 |
| HYP:ACOSH  |        |                                                                            |                  |                 |
| HYP:ATANH  |        |                                                                            |                  |                 |
| HYP:CSCH   |        | 1/SINH(X)                                                                  |                  |                 |
| HYP:SECH   |        | 1/COSH(X)                                                                  |                  |                 |
| HYP:COTH   |        | 1/TANH(X)                                                                  |                  |                 |
| HYP:ACSCH  |        | SINH(1/X)                                                                  |                  |                 |
| HYP:ASECH  |        | COSH(1/X)                                                                  |                  |                 |
| HYP:ACOTH  |        | TANH(1/X)                                                                  |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| PERC:%T    |        | Percentage of total                                                        | Y: TOTAL X: PART | X: % of Total   |
| PERC:%CH   |        | percentage of change from Y to X                                           | Y: OLD X: New    | X: % Change     |
| PERC:%     |        | Percentage                                                                 | Y: Y X: X        | Y: Y X: X% of Y |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| INT:FLOR   | FLOOR  | Truncate toward negative infinity                                          |                  |                 |
| INT:CEIL   |        | Truncate toward positive infinity                                          |                  |                 |
| INT:ROND   | ROUND  | Truncate toward nearest integer (even rule)                                |                  |                 |
| INT:TRUN   | IP     | Truncate toward zero                                                       |                  |                 |
| INT:▒▒▒▒   |        |                                                                            |                  |                 |
| INT:FP     |        |                                                                            |                  |                 |
| INT:GCD    |        | Greatest Common Denominator                                                |                  |                 |
| INT:LCM    |        | Least Common Multiple                                                      |                  |                 |
| INT:▒▒▒▒   |        |                                                                            |                  |                 |
| INT:▒▒▒▒   |        |                                                                            |                  |                 |
| INT:DIV    | BASE÷  |                                                                            |                  |                 |
| INT:REM    | MOD    |                                                                            |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| BINO:COMB  |        |                                                                            |                  |                 |
| BINO:PERM  |        |                                                                            |                  |                 |
| BINO:!     | N!     |                                                                            |                  |                 |
| BINO:PSI   | DIGAMM |                                                                            |                  |                 |
| BINO:GAM   | GAMMA  |                                                                            |                  |                 |
| BINO:BETA  |        | Beta function                                                              |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| ERR:ERF    |        | Error Function                                                             |                  |                 |
| ERR:ERFC   |        | Complementary Error Function                                               |                  |                 |
| ERR:▒▒▒▒   |        |                                                                            |                  |                 |
| ERR:NPDF   |        | Standard Normal Probablity Density FUnction                                |                  |                 |
| ERR:NCDF   |        | Standard Normal Cumulative Distribution FUnction                           |                  |                 |
| ERR:▒▒▒▒   |        |                                                                            |                  |                 |
|------------+--------+----------------------------------------------------------------------------+------------------+-----------------|
| MISC:¦¦    |        | Parallel Operator                                                          | Y  X             | X: 1/(1/X+1/Y)  |

