docs/sfun.html

<div id="outline-container-menu-sfun" class="outline-2">
<h2 id="menu-sfun"><span class="section-number-2">3.</span> <code>SFUN</code> Menu</h2>
<div class="outline-text-2" id="text-menu-sfun">
<table id="org529bb4b" border="2" cellspacing="0" cellpadding="6" rules="all" frame="box" align="center">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Menu</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">L&amp;P:lnYX</td>
<td class="org-left">lnYX</td>
<td class="org-left">Base Y Logarithm of X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:ln2</td>
<td class="org-left">ln2</td>
<td class="org-left">Base 2 logarithm</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:LN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Base 3 logarithm</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:LOG</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Base 10 logarithm</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:Y↑X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise Y to the power of X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:2↑X</td>
<td class="org-left">LBL 58</td>
<td class="org-left">Raise 2 to the power of X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:EXP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise e to the power of X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:10↑X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Raise 10 to the power of X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:Y√X</td>
<td class="org-left">YROOT</td>
<td class="org-left">Yth roots prefering real &amp; pure imaginary answers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:2√X</td>
<td class="org-left">LBL 57</td>
<td class="org-left">Square root prefering real &amp; pure imaginary answers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:3√X</td>
<td class="org-left">LBL 56</td>
<td class="org-left">Cube root prefering real &amp; pure imaginary answers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:5√X</td>
<td class="org-left">LBL 55</td>
<td class="org-left">Fifth root prefering real &amp; pure imaginary answers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">L&amp;P:7√X</td>
<td class="org-left">LBL 54</td>
<td class="org-left">Seventh root prefering real &amp; pure imaginary answers</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">CPLX:RPART</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Real Part of anumber or matrix</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPLX:IPART</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Imaginary Part of a number or matrix</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPLX:CONJ</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Complex conjugate of a number or matrix</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPLX:CABS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Magnitude of a number or matrix (built in <code>ABS</code> fails on a complex matrix)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">CPLX:CARG</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Complex argument of a number or matrix</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TRIG:SIN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:COS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:TAN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ASIN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ACOS</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ATAN</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:CSC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/SIN(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:SEC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/COS(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:COT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/TAN(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ACSC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SIN(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ASEC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">COS(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:ACOT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TAN(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:TAN2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:HYPOT</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:HAV</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Haversine = 1/2-cos(X)/2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:AHAV</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Inverse Haversine = 2*asin(sqrt(X))</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">TRIG:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">HYP:SINH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:COSH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:TANH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ASINH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ACOSH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ATANH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:CSCH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/SINH(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:SECH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/COSH(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:COTH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">1/TANH(X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ACSCH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">SINH(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ASECH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">COSH(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">HYP:ACOTH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">TANH(1/X)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PERC:%T</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Percentage of total</td>
<td class="org-left">Y: TOTAL X: PART</td>
<td class="org-left">X: % of Total</td>
</tr>

<tr>
<td class="org-left">PERC:%CH</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">percentage of change from Y to X</td>
<td class="org-left">Y: OLD X: New</td>
<td class="org-left">X: % Change</td>
</tr>

<tr>
<td class="org-left">PERC:%</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Percentage</td>
<td class="org-left">Y: Y X: X</td>
<td class="org-left">Y: Y X: X% of Y</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">INT:FLOR</td>
<td class="org-left">FLOOR</td>
<td class="org-left">Truncate toward negative infinity</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:CEIL</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Truncate toward positive infinity</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:ROND</td>
<td class="org-left">ROUND</td>
<td class="org-left">Truncate toward nearest integer (even rule)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:TRUN</td>
<td class="org-left">IP</td>
<td class="org-left">Truncate toward zero</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:FP</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:GCD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Greatest Common Denominator</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:LCM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Least Common Multiple</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:DIV</td>
<td class="org-left">BASE÷</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">INT:REM</td>
<td class="org-left">MOD</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">BINO:COMB</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BINO:PERM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BINO:!</td>
<td class="org-left">N!</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BINO:PSI</td>
<td class="org-left">DIGAMM</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BINO:GAM</td>
<td class="org-left">GAMMA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">BINO:BETA</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Beta function</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ERR:ERF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Error Function</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ERR:ERFC</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Complementary Error Function</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ERR:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ERR:NPDF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Standard Normal Probablity Density FUnction</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ERR:NCDF</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Standard Normal Cumulative Distribution FUnction</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ERR:▒▒▒▒</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MISC:¦¦</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Parallel Operator</td>
<td class="org-left">Y  X</td>
<td class="org-left">X: 1/(1/X+1/Y)</td>
</tr>
</tbody>
</table>
</div>
</div>
