src/sfun.org
* Menu Code

#+BEGIN_SRC elisp :var tbl=SFUN :colnames y :results output verbatum :wrap "src hp42s :eval never :tangle ../src_42s/sfun/sfun.hp42s"
(MJR-generate-42-menu-code "SFUN" 0 tbl 0 1 'stay 'up 'auto #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
#+END_SRC

#+RESULTS:
#+begin_src hp42s :eval never :tangle ../src_42s/sfun/sfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:SFUN)
@@@@ DSC: Auto-generated menu program
LBL "SFUN"
LBL 01            @@@@ Page 1 of menu SFUN
CLMENU
"L&P"
KEY 1 GTO 03
"CPLX"
KEY 2 GTO 04
"TRIG"
KEY 3 GTO 05
"HYP"
KEY 4 GTO 06
"PERC"
KEY 5 GTO 07
"INT"
KEY 6 GTO 08
KEY 7 GTO 02
KEY 8 GTO 02
KEY 9 GTO 00
MENU
STOP
GTO 01
LBL 02            @@@@ Page 2 of menu SFUN
CLMENU
"BINO"
KEY 1 GTO 09
"ERR"
KEY 2 GTO 10
"MISC"
KEY 3 GTO 11
KEY 7 GTO 01
KEY 8 GTO 01
KEY 9 GTO 00
MENU
STOP
GTO 02
LBL 03            @@@@ Page 1 of menu L&P
CLMENU
"lnYX"
KEY 1 XEQ "lnYX"
"ln2"
KEY 3 XEQ "ln2"
"LN"
KEY 4 XEQ 14
"LOG"
KEY 5 XEQ 15
KEY 7 GTO 13
KEY 8 GTO 12
KEY 9 GTO 01
MENU
STOP
GTO 03
LBL 12            @@@@ Page 2 of menu L&P
CLMENU
"Y↑X"
KEY 1 XEQ 16
"2↑X"
KEY 3 XEQ 58
"E↑X"
KEY 4 XEQ 17
"10↑X"
KEY 5 XEQ 18
KEY 7 GTO 03
KEY 8 GTO 13
KEY 9 GTO 01
MENU
STOP
GTO 12
LBL 13            @@@@ Page 3 of menu L&P
CLMENU
"Y√X"
KEY 1 XEQ "YROOT"
"2√X"
KEY 3 XEQ 57
"3√X"
KEY 4 XEQ 56
"5√X"
KEY 5 XEQ 55
"7√X"
KEY 6 XEQ 54
KEY 7 GTO 12
KEY 8 GTO 03
KEY 9 GTO 01
MENU
STOP
GTO 13
LBL 04            @@@@ Page 1 of menu CPLX
CLMENU
"RPART"
KEY 1 XEQ "RPART"
"IPART"
KEY 2 XEQ "IPART"
"CONJ"
KEY 3 XEQ "CONJ"
"CABS"
KEY 4 XEQ "CABS"
"CARG"
KEY 5 XEQ "CARG"
KEY 9 GTO 01
MENU
STOP
GTO 04
LBL 05            @@@@ Page 1 of menu TRIG
CLMENU
"SIN"
KEY 1 XEQ 21
"COS"
KEY 2 XEQ 22
"TAN"
KEY 3 XEQ 23
"ASIN"
KEY 4 XEQ 24
"ACOS"
KEY 5 XEQ 25
"ATAN"
KEY 6 XEQ 26
KEY 7 GTO 20
KEY 8 GTO 19
KEY 9 GTO 01
MENU
STOP
GTO 05
LBL 19            @@@@ Page 2 of menu TRIG
CLMENU
"CSC"
KEY 1 XEQ "CSC"
"SEC"
KEY 2 XEQ "SEC"
"COT"
KEY 3 XEQ "COT"
"ACSC"
KEY 4 XEQ "ACSC"
"ASEC"
KEY 5 XEQ "ASEC"
"ACOT"
KEY 6 XEQ "ACOT"
KEY 7 GTO 05
KEY 8 GTO 20
KEY 9 GTO 01
MENU
STOP
GTO 19
LBL 20            @@@@ Page 3 of menu TRIG
CLMENU
"TAN2"
KEY 1 XEQ "TAN2"
"HYPOT"
KEY 2 XEQ "HYPOT"
"HAV"
KEY 3 XEQ "HAV"
"AHAV"
KEY 4 XEQ "AHAV"
KEY 7 GTO 19
KEY 8 GTO 05
KEY 9 GTO 01
MENU
STOP
GTO 20
LBL 06            @@@@ Page 1 of menu HYP
CLMENU
"SINH"
KEY 1 XEQ 28
"COSH"
KEY 2 XEQ 29
"TANH"
KEY 3 XEQ 30
"ASINH"
KEY 4 XEQ 31
"ACOSH"
KEY 5 XEQ 32
"ATANH"
KEY 6 XEQ 33
KEY 7 GTO 27
KEY 8 GTO 27
KEY 9 GTO 01
MENU
STOP
GTO 06
LBL 27            @@@@ Page 2 of menu HYP
CLMENU
"CSCH"
KEY 1 XEQ "CSCH"
"SECH"
KEY 2 XEQ "SECH"
"COTH"
KEY 3 XEQ "COTH"
"ACSCH"
KEY 4 XEQ "ACSCH"
"ASECH"
KEY 5 XEQ "ASECH"
"ACOTH"
KEY 6 XEQ "ACOTH"
KEY 7 GTO 06
KEY 8 GTO 06
KEY 9 GTO 01
MENU
STOP
GTO 27
LBL 07            @@@@ Page 1 of menu PERC
CLMENU
"%T"
KEY 1 XEQ "%T"
"%CH"
KEY 2 XEQ 34
"%"
KEY 3 XEQ 35
KEY 9 GTO 01
MENU
STOP
GTO 07
LBL 08            @@@@ Page 1 of menu INT
CLMENU
"FLOR"
KEY 1 XEQ "FLOOR"
"CEIL"
KEY 2 XEQ "CEIL"
"ROND"
KEY 3 XEQ "ROUND"
"TRUN"
KEY 4 XEQ 37
"FP"
KEY 6 XEQ 38
KEY 7 GTO 36
KEY 8 GTO 36
KEY 9 GTO 01
MENU
STOP
GTO 08
LBL 36            @@@@ Page 2 of menu INT
CLMENU
"GCD"
KEY 1 XEQ "GCD"
"LCM"
KEY 2 XEQ "LCM"
"DIV"
KEY 5 XEQ 39
"REM"
KEY 6 XEQ 40
KEY 7 GTO 08
KEY 8 GTO 08
KEY 9 GTO 01
MENU
STOP
GTO 36
LBL 09            @@@@ Page 1 of menu BINO
CLMENU
"COMB"
KEY 1 XEQ 41
"PERM"
KEY 2 XEQ 42
"!"
KEY 3 XEQ 43
"PSI"
KEY 4 XEQ "DIGAMM"
"GAM"
KEY 5 XEQ 44
"BETA"
KEY 6 XEQ "BETA"
KEY 9 GTO 02
MENU
STOP
GTO 09
LBL 10            @@@@ Page 1 of menu ERR
CLMENU
"ERF"
KEY 1 XEQ "ERF"
"ERFC"
KEY 2 XEQ "ERFC"
"NPDF"
KEY 4 XEQ "NPDF"
"NCDF"
KEY 5 XEQ "NCDF"
KEY 9 GTO 02
MENU
STOP
GTO 10
LBL 11            @@@@ Page 1 of menu MISC
CLMENU
"||"
KEY 1 XEQ "||"
KEY 9 GTO 02
MENU
STOP
GTO 11
LBL 00 @@@@ Application Exit
EXITALL
RTN
LBL 14    @@@@ Action for menu key LN
LN
RTN
LBL 15    @@@@ Action for menu key LOG
LOG
RTN
LBL 16    @@@@ Action for menu key Y↑X
Y↑X
RTN
LBL 17    @@@@ Action for menu key E↑X
E↑X
RTN
LBL 18    @@@@ Action for menu key 10↑X
10↑X
RTN
LBL 21    @@@@ Action for menu key SIN
SIN
RTN
LBL 22    @@@@ Action for menu key COS
COS
RTN
LBL 23    @@@@ Action for menu key TAN
TAN
RTN
LBL 24    @@@@ Action for menu key ASIN
ASIN
RTN
LBL 25    @@@@ Action for menu key ACOS
ACOS
RTN
LBL 26    @@@@ Action for menu key ATAN
ATAN
RTN
LBL 28    @@@@ Action for menu key SINH
SINH
RTN
LBL 29    @@@@ Action for menu key COSH
COSH
RTN
LBL 30    @@@@ Action for menu key TANH
TANH
RTN
LBL 31    @@@@ Action for menu key ASINH
ASINH
RTN
LBL 32    @@@@ Action for menu key ACOSH
ACOSH
RTN
LBL 33    @@@@ Action for menu key ATANH
ATANH
RTN
LBL 34    @@@@ Action for menu key %CH
%CH
RTN
LBL 35    @@@@ Action for menu key %
%
RTN
LBL 37    @@@@ Action for menu key TRUN
IP
RTN
LBL 38    @@@@ Action for menu key FP
FP
RTN
LBL 39    @@@@ Action for menu key DIV
BASE÷
RTN
LBL 40    @@@@ Action for menu key REM
MOD
RTN
LBL 41    @@@@ Action for menu key COMB
COMB
RTN
LBL 42    @@@@ Action for menu key PERM
PERM
RTN
LBL 43    @@@@ Action for menu key !
N!
RTN
LBL 44    @@@@ Action for menu key GAM
GAMMA
RTN
@@@@ Free labels start at: 45
#+end_src

