docs/sfun.html

<div id="outline-container-orgefc6f2f" class="outline-2">
<h2 id="orgefc6f2f"><span class="section-number-2">4.</span> Menu Code</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-elisp">(MJR-generate-42-menu-code <span style="color: #fa8072;">"SFUN"</span> 0 tbl 0 1 'stay 'up 'auto #'MJR-custom-gen-lab #'MJR-custom-gen-sub)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-SFUN" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (SFUN)</span>
<span style="color: #ffa500;">@@@@ DSC: Auto-generated menu program</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"SFUN"</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">01</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu SFUN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"L&amp;P"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">03</span>
<span style="color: #fa8072;">"CPLX"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">04</span>
<span style="color: #fa8072;">"TRIG"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">05</span>
<span style="color: #fa8072;">"HYP"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">06</span>
<span style="color: #fa8072;">"PERC"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">07</span>
<span style="color: #fa8072;">"INT"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">08</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">00</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">02</span>            <span style="color: #ffa500;">@@@@ Page 2 of menu SFUN</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"BINO"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">09</span>
<span style="color: #fa8072;">"ERR"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">10</span>
<span style="color: #fa8072;">"MISC"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">11</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">00</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">03</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu L&amp;P</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"lnYX"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"lnYX"</span>
<span style="color: #fa8072;">"ln2"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ln2"</span>
<span style="color: #fa8072;">"LN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">14</span>
<span style="color: #fa8072;">"LOG"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">15</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">13</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">12</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">03</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">12</span>            <span style="color: #ffa500;">@@@@ Page 2 of menu L&amp;P</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Y&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">16</span>
<span style="color: #fa8072;">"2&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">58</span>
<span style="color: #fa8072;">"EXP"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"EXP"</span>
<span style="color: #fa8072;">"10&#8593;X"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">17</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">03</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">13</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">12</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">13</span>            <span style="color: #ffa500;">@@@@ Page 3 of menu L&amp;P</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"Y&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #fa8072;">"2&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">57</span>
<span style="color: #fa8072;">"3&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">56</span>
<span style="color: #fa8072;">"5&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">55</span>
<span style="color: #fa8072;">"7&#8730;X"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">54</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">12</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">03</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">13</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">04</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu CPLX</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"RPART"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"RPART"</span>
<span style="color: #fa8072;">"IPART"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"IPART"</span>
<span style="color: #fa8072;">"CONJ"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CONJ"</span>
<span style="color: #fa8072;">"CABS"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CABS"</span>
<span style="color: #fa8072;">"CARG"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CARG"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">04</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">05</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu TRIG</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"SIN"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">20</span>
<span style="color: #fa8072;">"COS"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">21</span>
<span style="color: #fa8072;">"TAN"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">22</span>
<span style="color: #fa8072;">"ASIN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">23</span>
<span style="color: #fa8072;">"ACOS"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">24</span>
<span style="color: #fa8072;">"ATAN"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">25</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">19</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">18</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">05</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">18</span>            <span style="color: #ffa500;">@@@@ Page 2 of menu TRIG</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"CSC"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CSC"</span>
<span style="color: #fa8072;">"SEC"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"SEC"</span>
<span style="color: #fa8072;">"COT"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"COT"</span>
<span style="color: #fa8072;">"ACSC"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ACSC"</span>
<span style="color: #fa8072;">"ASEC"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ASEC"</span>
<span style="color: #fa8072;">"ACOT"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ACOT"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">05</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">19</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">18</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">19</span>            <span style="color: #ffa500;">@@@@ Page 3 of menu TRIG</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"TAN2"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"TAN2"</span>
<span style="color: #fa8072;">"HYPOT"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"HYPOT"</span>
<span style="color: #fa8072;">"HAV"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"HAV"</span>
<span style="color: #fa8072;">"AHAV"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"AHAV"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">18</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">05</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">19</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">06</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu HYP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"SINH"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">27</span>
<span style="color: #fa8072;">"COSH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">28</span>
<span style="color: #fa8072;">"TANH"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">29</span>
<span style="color: #fa8072;">"ASINH"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">30</span>
<span style="color: #fa8072;">"ACOSH"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">31</span>
<span style="color: #fa8072;">"ATANH"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">32</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">26</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">26</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">06</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">26</span>            <span style="color: #ffa500;">@@@@ Page 2 of menu HYP</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"CSCH"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CSCH"</span>
<span style="color: #fa8072;">"SECH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"SECH"</span>
<span style="color: #fa8072;">"COTH"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"COTH"</span>
<span style="color: #fa8072;">"ACSCH"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ACSCH"</span>
<span style="color: #fa8072;">"ASECH"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ASECH"</span>
<span style="color: #fa8072;">"ACOTH"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ACOTH"</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">06</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">06</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">26</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">07</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu PERC</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"%T"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"%T"</span>
<span style="color: #fa8072;">"%CH"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">33</span>
<span style="color: #fa8072;">"%"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">34</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">07</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">08</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu INT</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"FLOR"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"FLOOR"</span>
<span style="color: #fa8072;">"CEIL"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"CEIL"</span>
<span style="color: #fa8072;">"ROND"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ROUND"</span>
<span style="color: #fa8072;">"TRUN"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">36</span>
<span style="color: #fa8072;">"FP"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">37</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">35</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">35</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">08</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">35</span>            <span style="color: #ffa500;">@@@@ Page 2 of menu INT</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"GCD"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"GCD"</span>
<span style="color: #fa8072;">"LCM"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"LCM"</span>
<span style="color: #fa8072;">"DIV"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">38</span>
<span style="color: #fa8072;">"REM"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">39</span>
<span style="color: #00ffff;">KEY</span> 7 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">08</span>
<span style="color: #00ffff;">KEY</span> 8 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">08</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">01</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">35</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">09</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu BINO</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"COMB"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">40</span>
<span style="color: #fa8072;">"PERM"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">41</span>
<span style="color: #fa8072;">"!"</span>
<span style="color: #00ffff;">KEY</span> 3 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">42</span>
<span style="color: #fa8072;">"PSI"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"DIGAMM"</span>
<span style="color: #fa8072;">"GAM"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">43</span>
<span style="color: #fa8072;">"BETA"</span>
<span style="color: #00ffff;">KEY</span> 6 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"BETA"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">09</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">10</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu ERR</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"ERF"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ERF"</span>
<span style="color: #fa8072;">"ERFC"</span>
<span style="color: #00ffff;">KEY</span> 2 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"ERFC"</span>
<span style="color: #fa8072;">"NPDF"</span>
<span style="color: #00ffff;">KEY</span> 4 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"NPDF"</span>
<span style="color: #fa8072;">"NCDF"</span>
<span style="color: #00ffff;">KEY</span> 5 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"NCDF"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">10</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">11</span>            <span style="color: #ffa500;">@@@@ Page 1 of menu MISC</span>
<span style="color: #00ffff;">CLMENU</span>
<span style="color: #fa8072;">"||"</span>
<span style="color: #00ffff;">KEY</span> 1 <span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"||"</span>
<span style="color: #00ffff;">KEY</span> 9 <span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">02</span>
<span style="color: #00ffff;">MENU</span>
<span style="color: #00ffff;">STOP</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">11</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">00</span> <span style="color: #ffa500;">@@@@ Application Exit</span>
<span style="color: #00ffff;">EXITALL</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">14</span>    <span style="color: #ffa500;">@@@@ Action for menu key LN</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">15</span>    <span style="color: #ffa500;">@@@@ Action for menu key LOG</span>
<span style="color: #00ffff;">LOG</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">16</span>    <span style="color: #ffa500;">@@@@ Action for menu key Y&#8593;X</span>
<span style="color: #00ffff;">Y&#8593;X</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">17</span>    <span style="color: #ffa500;">@@@@ Action for menu key 10&#8593;X</span>
<span style="color: #00ffff;">10&#8593;X</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">20</span>    <span style="color: #ffa500;">@@@@ Action for menu key SIN</span>
<span style="color: #00ffff;">SIN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">21</span>    <span style="color: #ffa500;">@@@@ Action for menu key COS</span>
<span style="color: #00ffff;">COS</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">22</span>    <span style="color: #ffa500;">@@@@ Action for menu key TAN</span>
<span style="color: #00ffff;">TAN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">23</span>    <span style="color: #ffa500;">@@@@ Action for menu key ASIN</span>
<span style="color: #00ffff;">ASIN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">24</span>    <span style="color: #ffa500;">@@@@ Action for menu key ACOS</span>
<span style="color: #00ffff;">ACOS</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">25</span>    <span style="color: #ffa500;">@@@@ Action for menu key ATAN</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">27</span>    <span style="color: #ffa500;">@@@@ Action for menu key SINH</span>
<span style="color: #00ffff;">SINH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">28</span>    <span style="color: #ffa500;">@@@@ Action for menu key COSH</span>
<span style="color: #00ffff;">COSH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">29</span>    <span style="color: #ffa500;">@@@@ Action for menu key TANH</span>
<span style="color: #00ffff;">TANH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">30</span>    <span style="color: #ffa500;">@@@@ Action for menu key ASINH</span>
<span style="color: #00ffff;">ASINH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">31</span>    <span style="color: #ffa500;">@@@@ Action for menu key ACOSH</span>
<span style="color: #00ffff;">ACOSH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">32</span>    <span style="color: #ffa500;">@@@@ Action for menu key ATANH</span>
<span style="color: #00ffff;">ATANH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">33</span>    <span style="color: #ffa500;">@@@@ Action for menu key %CH</span>
<span style="color: #00ffff;">%CH</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">34</span>    <span style="color: #ffa500;">@@@@ Action for menu key %</span>
<span style="color: #00ffff;">%</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">36</span>    <span style="color: #ffa500;">@@@@ Action for menu key TRUN</span>
<span style="color: #00ffff;">IP</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">37</span>    <span style="color: #ffa500;">@@@@ Action for menu key FP</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">38</span>    <span style="color: #ffa500;">@@@@ Action for menu key DIV</span>
<span style="color: #00ffff;">BASE&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">39</span>    <span style="color: #ffa500;">@@@@ Action for menu key REM</span>
<span style="color: #00ffff;">MOD</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">40</span>    <span style="color: #ffa500;">@@@@ Action for menu key COMB</span>
<span style="color: #00ffff;">COMB</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">41</span>    <span style="color: #ffa500;">@@@@ Action for menu key PERM</span>
<span style="color: #00ffff;">PERM</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">42</span>    <span style="color: #ffa500;">@@@@ Action for menu key !</span>
<span style="color: #00ffff;">N!</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">43</span>    <span style="color: #ffa500;">@@@@ Action for menu key GAM</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #ffa500;">@@@@ Free labels start at: 44</span>
</pre>
</div>
</div>
</div>
