src/sfun.org
** Complex Numbers

#+BEGIN_src hp42s :eval never :tangle ../src_42s/sfun/sfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:RPART)
@@@@ DSC: Real part
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: rpart(x)
@@@@ LBL: 69-72
@@@@ TST: free42_3.0.2
@@@@ UPD: 2021-04-22
LBL "RPART"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
XEQ 89          @@@@ ATYP
X=0?
RTNERR 4        @@## REQ:free42>=2.5.24
1/X             @@## REQ:free42<2.5.24
68
+
GTO IND ST X
LBL 69          @@@@ Real Number
LBL 70          @@@@ Real Matrix
R↓
RTN
LBL 71          @@@@ Complex Number
LBL 72          @@@@ Complex Matrix
R↓
XEQ 98          @@@@ C→R&I
X<>Y
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:IPART)
@@@@ DSC: Imaginary Part
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: ipart(x)
@@@@ LBL: 73-76
@@@@ TST: free42_3.0.2
@@@@ UPD: 2021-04-22
LBL "IPART"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
XEQ 89          @@@@ ATYP
X=0?
RTNERR 4        @@## REQ:free42>=2.5.24
1/X             @@## REQ:free42<2.5.24
72
+
GTO IND ST X
LBL 73          @@@@ Real Number
0
RTN
LBL 74          @@@@ Real Matrix
R↓
DIM?
NEWMAT
RTN
LBL 75          @@@@ Complex Number
LBL 76          @@@@ Complex Matrix
R↓
XEQ 98          @@@@ C→R&I
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CONJ)
@@@@ DSC: Complex Conjugate
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: conj(x)
@@@@ TST: free42_3.0.2
@@@@ LBL: 77-80
@@@@ BUG: Fails on alpha string matrix
@@@@ UPD: 2021-04-22
LBL "CONJ"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
XEQ 89          @@@@ ATYP
X=0?
RTNERR 4        @@## REQ:free42>=2.5.24
1/X             @@## REQ:free42<2.5.24
76
+
GTO IND ST X
LBL 77          @@@@ Real Number
LBL 78          @@@@ Real Matrix
R↓
RTN
LBL 79          @@@@ Complex Number
LBL 80          @@@@ Complex Matrix
R↓
COMPLEX
+/-
COMPLEX
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CABS)
@@@@ DSC: Magnitude/absolute value
@@@@ IN:  X: Number or numeric matrix (element-wise) -- built in ABS won't work with a complex matrix
@@@@ OUT: X: |x|
@@@@ TST: CPXRES free42_3.0
@@@@ LBL: 81-84
@@@@ BUG: Returns 0 for real 0 input
@@@@ UPD: 2024-02-12
LBL "CABS"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
XEQ 89          @@@@ ATYP
X=0?
RTNERR 4        @@## REQ:free42>=2.5.24
1/X             @@## REQ:free42<2.5.24
80
+
GTO IND ST X
LBL 81          @@@@ Real Number
LBL 82          @@@@ Real Matrix
R↓
ABS
RTN
LBL 83          @@@@ Complex Number
LBL 84          @@@@ Complex Matrix
R↓
XEQ 47          @@@@ C→M&A
X<>Y
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:CARG)
@@@@ DSC: Complex Argument
@@@@ IN:  X: Number or numeric matrix (element-wise)
@@@@ OUT: X: arg(x)
@@@@ TST: CPXRES free42_3.0
@@@@ LBL: 85-88
@@@@ BUG: Returns 0 for real 0 input
@@@@ UPD: 2024-02-12
LBL "CARG"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
XEQ 89          @@@@ ATYP
X=0?
RTNERR 4        @@## REQ:free42>=2.5.24
1/X             @@## REQ:free42<2.5.24
84
+
GTO IND ST X
LBL 85          @@@@ Real Number
0
RTN
LBL 86          @@@@ Real Matrix
R↓
DIM?
NEWMAT
RTN
LBL 87          @@@@ Complex Number
LBL 88          @@@@ Complex Matrix
R↓
XEQ 47          @@@@ C→M&A
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: Complex Number -> Real Part & Imaginary Part
@@@@ NAM: C→R&I 98
@@@@ IN:  X: Complex Number or Complex Matrix
@@@@ OUT: Y: Real Part of X
@@@@      X: Imaginary Part of X
@@@@ LBL: 97
@@@@ TST: free42_3.0.2
@@@@ UPD: 2021-04-22
LBL 98
FUNC 12         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
FS? 73
GTO 97
@@@@ RECT MODE
COMPLEX
RTN
LBL 97
@@@@ POLAR MODE
RECT
COMPLEX
POLAR
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: Complex Number -> Magnitude & Argument (angle)
@@@@ NAM: C→M&A 47
@@@@ IN:  X: Complex Number or Complex Matrix
@@@@ OUT: Y: Magnitude of X
@@@@      X: Complex Argument (angle) of X
@@@@ LBL: 99
@@@@ TST: free42_3.0.2
@@@@ UPD: 2024-02-12
LBL 47
FUNC 12         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
FS? 73
GTO 99
@@@@ RECT MODE
POLAR
COMPLEX
RECT
RTN
LBL 99
@@@@ POLAR MODE
COMPLEX
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
@@@@ DSC: Arithmetic Type
@@@@ NAM: ATYP 89
@@@@ IN:  X: an object
@@@@ OUT: X: 1 if input X was a real number
@@@@         2 if input X was a real matrix
@@@@         3 if input X was a complex number
@@@@         4 if input X was a complex matrix
@@@@         0 if none of the above are true
@@@@ TST: free42_3.0.2
@@@@ FAQ: Even on free42<2.5.24 or a real 42s, X, Y, & Z are preserved. T & Last X not so much.
@@@@ BUG: A 2 will be returned for a real matrix containing strings
@@@@ BUG: In infinite stack mode with an empty stack 2 will be returned as X=0 when we do L4STK
@@@@ LBL: 90-97
@@@@ UPD: 2021-02-23
LBL 89
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
MAT?
GTO 90
GTO 91
LBL 90          @@@@ Matrix
CLA
ARCL ST X
67
POSA
X>0?
GTO 96
GTO 97
LBL 96          @@@@ Complex Matrix
4
RTN
LBL 97          @@@@ Real/String Matrix
2
RTN
LBL 91          @@@@ Not matrix
REAL?
GTO 92
GTO 93
LBL 92          @@@@ Real number
1
RTN
LBL 93          @@@@ Not matrix or real
CPX?
GTO 94
GTO 95
LBL 94          @@@@ Complex number
3
RTN
LBL 95          @@@@ Not matrix, real, or complex
0
RTN
#+END_SRC

