docs/sfun.html

<div id="outline-container-org34d2082" class="outline-2">
<h2 id="org34d2082"><span class="section-number-2">5.</span> Functions</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org3078e46" class="outline-3">
<h3 id="org3078e46"><span class="section-number-3">5.1.</span> Complex Numbers</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-RPART" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (RPART)</span>
<span style="color: #ffa500;">@@@@ DSC: Real part</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: rpart(x)</span>
<span style="color: #ffa500;">@@@@ LBL: 69-72</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"RPART"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">89</span>          <span style="color: #ffa500;">@@@@ ATYP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">RTNERR</span> 4        <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #6495ed;">@@## REQ:free42&lt;2.5.24</span>
68
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">69</span>          <span style="color: #ffa500;">@@@@ Real Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">70</span>          <span style="color: #ffa500;">@@@@ Real Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">71</span>          <span style="color: #ffa500;">@@@@ Complex Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">72</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">98</span>          <span style="color: #ffa500;">@@@@ C&#8594;R&amp;I</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-IPART" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (IPART)</span>
<span style="color: #ffa500;">@@@@ DSC: Imaginary Part</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: ipart(x)</span>
<span style="color: #ffa500;">@@@@ LBL: 73-76</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"IPART"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">89</span>          <span style="color: #ffa500;">@@@@ ATYP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">RTNERR</span> 4        <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #6495ed;">@@## REQ:free42&lt;2.5.24</span>
72
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">73</span>          <span style="color: #ffa500;">@@@@ Real Number</span>
0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">74</span>          <span style="color: #ffa500;">@@@@ Real Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
DIM?
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">75</span>          <span style="color: #ffa500;">@@@@ Complex Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">76</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">98</span>          <span style="color: #ffa500;">@@@@ C&#8594;R&amp;I</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CONJ" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CONJ)</span>
<span style="color: #ffa500;">@@@@ DSC: Complex Conjugate</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: conj(x)</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ LBL: 77-80</span>
<span style="color: #ffa500;">@@@@ BUG: Fails on alpha string matrix</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"CONJ"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">89</span>          <span style="color: #ffa500;">@@@@ ATYP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">RTNERR</span> 4        <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #6495ed;">@@## REQ:free42&lt;2.5.24</span>
76
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">77</span>          <span style="color: #ffa500;">@@@@ Real Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">78</span>          <span style="color: #ffa500;">@@@@ Real Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">79</span>          <span style="color: #ffa500;">@@@@ Complex Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">80</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CABS" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CABS)</span>
<span style="color: #ffa500;">@@@@ DSC: Magnitude/absolute value</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise) -- built in ABS won't work with a complex matrix</span>
<span style="color: #ffa500;">@@@@ OUT: X: |x|</span>
<span style="color: #ffa500;">@@@@ TST: CPXRES free42_3.0</span>
<span style="color: #ffa500;">@@@@ LBL: 81-84</span>
<span style="color: #ffa500;">@@@@ BUG: Returns 0 for real 0 input</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"CABS"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">89</span>          <span style="color: #ffa500;">@@@@ ATYP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">RTNERR</span> 4        <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #6495ed;">@@## REQ:free42&lt;2.5.24</span>
80
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">81</span>          <span style="color: #ffa500;">@@@@ Real Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">82</span>          <span style="color: #ffa500;">@@@@ Real Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">83</span>          <span style="color: #ffa500;">@@@@ Complex Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">84</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">98</span>          <span style="color: #ffa500;">@@@@ C&#8594;M&amp;A</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CARG" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CARG)</span>
<span style="color: #ffa500;">@@@@ DSC: Complex Argument</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: arg(x)</span>
<span style="color: #ffa500;">@@@@ TST: CPXRES free42_3.0</span>
<span style="color: #ffa500;">@@@@ LBL: 85-88</span>
<span style="color: #ffa500;">@@@@ BUG: Returns 0 for real 0 input</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"CARG"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">89</span>          <span style="color: #ffa500;">@@@@ ATYP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">RTNERR</span> 4        <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #6495ed;">@@## REQ:free42&lt;2.5.24</span>
84
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GTO IND ST</span> X
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">85</span>          <span style="color: #ffa500;">@@@@ Real Number</span>
0
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">86</span>          <span style="color: #ffa500;">@@@@ Real Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
DIM?
<span style="color: #00ffff;">NEWMAT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">87</span>          <span style="color: #ffa500;">@@@@ Complex Number</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">88</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">98</span>          <span style="color: #ffa500;">@@@@ C&#8594;M&amp;A</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Complex Number -&gt; Real Part &amp; Imaginary Part</span>
<span style="color: #ffa500;">@@@@ NAM: C&#8594;R&amp;I 98</span>
<span style="color: #ffa500;">@@@@ IN:  X: Complex Number or Complex Matrix</span>
<span style="color: #ffa500;">@@@@ OUT: Y: Real Part of X</span>
<span style="color: #ffa500;">@@@@      X: Imaginary Part of X</span>
<span style="color: #ffa500;">@@@@ LBL: 97</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">98</span>
<span style="color: #00ffff;">FUNC</span> 12         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FS?</span> 73
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">97</span>
<span style="color: #ffa500;">@@@@ RECT MODE</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">97</span>
<span style="color: #ffa500;">@@@@ POLAR MODE</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Complex Number -&gt; Magnitude &amp; Argument (angle)</span>
<span style="color: #ffa500;">@@@@ NAM: C&#8594;M&amp;A 98</span>
<span style="color: #ffa500;">@@@@ IN:  X: Complex Number or Complex Matrix</span>
<span style="color: #ffa500;">@@@@ OUT: Y: Magnitude of X</span>
<span style="color: #ffa500;">@@@@      X: Complex Argument (angle) of X</span>
<span style="color: #ffa500;">@@@@ LBL: 99</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-22</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">98</span>
<span style="color: #00ffff;">FUNC</span> 12         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ENTER</span>
<span style="color: #00ffff;">FS?</span> 73
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">99</span>
<span style="color: #ffa500;">@@@@ RECT MODE</span>
<span style="color: #00ffff;">POLAR</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RECT</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">99</span>
<span style="color: #ffa500;">@@@@ POLAR MODE</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Arithmetic Type</span>
<span style="color: #ffa500;">@@@@ NAM: ATYP 89</span>
<span style="color: #ffa500;">@@@@ IN:  X: an object</span>
<span style="color: #ffa500;">@@@@ OUT: X: 1 if input X was a real number</span>
<span style="color: #ffa500;">@@@@         2 if input X was a real matrix</span>
<span style="color: #ffa500;">@@@@         3 if input X was a complex number</span>
<span style="color: #ffa500;">@@@@         4 if input X was a complex matrix</span>
<span style="color: #ffa500;">@@@@         0 if none of the above are true</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ FAQ: Even on free42&lt;2.5.24 or a real 42s, X, Y, &amp; Z are preserved. T &amp; Last X not so much.</span>
<span style="color: #ffa500;">@@@@ BUG: A 2 will be returned for a real matrix containing strings</span>
<span style="color: #ffa500;">@@@@ BUG: In infinite stack mode with an empty stack 2 will be returned as X=0 when we do L4STK</span>
<span style="color: #ffa500;">@@@@ LBL: 90-97</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">89</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
MAT?
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">90</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">91</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">90</span>          <span style="color: #ffa500;">@@@@ Matrix</span>
<span style="color: #00ffff;">CLA</span>
<span style="color: #00ffff;">ARCL</span> ST X
67
<span style="color: #00ffff;">POSA</span>
<span style="color: #00ffff;">X&gt;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">96</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">97</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">96</span>          <span style="color: #ffa500;">@@@@ Complex Matrix</span>
4
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">97</span>          <span style="color: #ffa500;">@@@@ Real/String Matrix</span>
2
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">91</span>          <span style="color: #ffa500;">@@@@ Not matrix</span>
<span style="color: #00ffff;">REAL?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">92</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">93</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">92</span>          <span style="color: #ffa500;">@@@@ Real number</span>
1
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">93</span>          <span style="color: #ffa500;">@@@@ Not matrix or real</span>
CPX?
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">94</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">95</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">94</span>          <span style="color: #ffa500;">@@@@ Complex number</span>
3
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">95</span>          <span style="color: #ffa500;">@@@@ Not matrix, real, or complex</span>
0
RTN
</pre>
</div>
</div>
</div>
