src/sfun.org
** Percentages

#+BEGIN_src hp42s :eval never :tangle ../src_42s/sfun/sfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:PTOT)
@@@@ DSC: Percentage of total (just like hp-12c button)
@@@@ IN:  Y: Real Number -- Total
@@@@      X: Real Number -- Part
@@@@ OUT: Y: Y
@@@@      X: 100*X/Y
@@@@ UPD: 2021-03-12
LBL "%T"
FUNC 22         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
RCL÷ ST Y
100
×
RTN
#+END_SRC

