docs/sfun.html

<div id="outline-container-orgfb9cb03" class="outline-3">
<h3 id="orgfb9cb03"><span class="section-number-3">5.2.</span> Percentages</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-PTOT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (PTOT)</span>
<span style="color: #ffa500;">@@@@ DSC: Percentage of total (just like hp-12c button)</span>
<span style="color: #ffa500;">@@@@ IN:  Y: Real Number -- Total</span>
<span style="color: #ffa500;">@@@@      X: Real Number -- Part</span>
<span style="color: #ffa500;">@@@@ OUT: Y: Y</span>
<span style="color: #ffa500;">@@@@      X: 100*X/Y</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-03-12</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"%T"</span>
<span style="color: #00ffff;">FUNC</span> 22         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">RCL&#247; ST</span> Y
100
<span style="color: #00ffff;">&#215;</span>
RTN
</pre>
</div>
</div>
</div>
