docs/sfun.html

<div id="outline-container-orge6b3b32" class="outline-3">
<h3 id="orge6b3b32"><span class="section-number-3">5.4.</span> Binomials, Factorals, Beta, etc&#x2026;</h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-BETA" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (BETA)</span>
<span style="color: #ffa500;">@@@@ DSC: beta function</span>
<span style="color: #ffa500;">@@@@ IN:  Y: Number</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number</span>
<span style="color: #ffa500;">@@@@ OUT: X: beta(x, y) = beta(y, x)</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"BETA"</span>
<span style="color: #00ffff;">FUNC</span> 21         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">RCL ST</span> Z
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">GAMMA</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-DIGAMM" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (DIGAMM)</span>
<span style="color: #ffa500;">@@@@ DSC: digamma function</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number</span>
<span style="color: #ffa500;">@@@@ OUT: X: psi(X)</span>
<span style="color: #ffa500;">@@@@ FAQ: Good to about 1e-5 for real X&gt;0.1</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-05-02</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"DIGAMM"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"_X"</span>       <span style="color: #ffa500;">@@@@ X</span>
2               <span style="color: #ffa500;">@@@@ 2 X</span>
<span style="color: #00ffff;">+</span>               <span style="color: #ffa500;">@@@@ 2+X</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"_S"</span>       <span style="color: #ffa500;">@@@@ S</span>
<span style="color: #00ffff;">LN</span>              <span style="color: #ffa500;">@@@@ SUM            ln(s)</span>
2               <span style="color: #ffa500;">@@@@ 2 S SUM</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_S"</span>       <span style="color: #ffa500;">@@@@ 2*S SUM</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #ffa500;">@@@@ TRM SUM         </span>
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM            ln(s) -1/(2*s)</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"_S"</span>        <span style="color: #ffa500;">@@@@ S SUM</span>
X&#8593;2             <span style="color: #ffa500;">@@@@ S^2 SUM</span>
<span style="color: #00ffff;">LSTO</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ SS SUM</span>
12              <span style="color: #ffa500;">@@@@ 12 S^2 SUM</span>
<span style="color: #00ffff;">&#215;</span>               <span style="color: #ffa500;">@@@@ 12*S^2 SUM</span>
<span style="color: #00ffff;">1/X</span>             <span style="color: #ffa500;">@@@@ TRM SUM</span>
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM             ln(s) -1/(2*s) -1/(12*s^2)</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"_SS"</span>       <span style="color: #ffa500;">@@@@ S^2 SUM       </span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^4 SUM       </span>
<span style="color: #00ffff;">STO ST</span> Z        <span style="color: #ffa500;">@@@@ S^4 SUM S^4</span>
120
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">+</span>               <span style="color: #ffa500;">@@@@ SUM S^4         ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4)</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^6 SUM       </span>
<span style="color: #00ffff;">STO ST</span> Z        <span style="color: #ffa500;">@@@@ S^6 SUM S^6</span>
252
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>         
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM S^6         ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6)</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^8 SUM       </span>
<span style="color: #00ffff;">STO ST</span> Z        <span style="color: #ffa500;">@@@@ S^8 SUM S^8</span>
240
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>         
<span style="color: #00ffff;">+</span>               <span style="color: #ffa500;">@@@@ SUM S^8         ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8)</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^10 SUM       </span>
<span style="color: #00ffff;">STO ST</span> Z        <span style="color: #ffa500;">@@@@ S^10 SUM S^10</span>
660
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>
5
<span style="color: #00ffff;">&#215;</span>        
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM S^10        ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8) -5/(660*s^10)</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^12 SUM       </span>
<span style="color: #00ffff;">STO ST</span> Z        <span style="color: #ffa500;">@@@@ S^12 SUM S^12</span>
32760
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>
691
<span style="color: #00ffff;">&#215;</span>        
<span style="color: #00ffff;">+</span>               <span style="color: #ffa500;">@@@@ SUM S^12        ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8) -5/(660*s^10) +691/(32760*s^12)</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">RCL&#215;</span> <span style="color: #fa8072;">"_SS"</span>      <span style="color: #ffa500;">@@@@ S^14 SUM       </span>
12
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM             ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8) -5/(660*s^10) +691/(32760*s^12) -1/(12*s^14)</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"_X"</span>                   
<span style="color: #00ffff;">1/X</span>                        
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM             ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8) -5/(660*s^10) +691/(32760*s^12) -1/(12*s^14) -1/x</span>
<span style="color: #00ffff;">RCL</span> <span style="color: #fa8072;">"_X"</span>                   
1                          
<span style="color: #00ffff;">+</span>                          
<span style="color: #00ffff;">1/X</span>                        
<span style="color: #00ffff;">-</span>               <span style="color: #ffa500;">@@@@ SUM             ln(s) -1/(2*s) -1/(12*s^2) +1/(120*s^4) -1/(252*s^6) +1/(240*s^8) -5/(660*s^10) +691/(32760*s^12) -1/(12*s^14) -1/x -1/(x+1)</span>
<span style="color: #00ffff;">RTN</span>

</pre>
</div>
</div>
</div>
