src/sfun.org
** Error & Standard Normal Functions

#+BEGIN_src hp42s :eval never :tangle ../src_42s/sfun/sfun.hp42s
@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:NPDF)
@@@@ DSC: Standard Normal PDF
@@@@ IN:  X: real number
@@@@ OUT: X: Standard Normal PDF value at X
@@@@ UPD: 2021-04-22
@@@@ TST: free42_3.0.2
@@@@ TC:  -2 0.05399096651318805195056
@@@@ TC:  -1 0.2419707245191433497978
@@@@ TC:   0 0.3989422804014326779399
@@@@ TC:   1 0.2419707245191433497978
@@@@ TC:   2 0.05399096651318805195056
LBL "NPDF"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
X↑2             @@@@ X^2
-2              @@@@ -2                     X^2
÷               @@@@ -X^2/2
E↑X             @@@@ EXP(-X^2/2)
2               @@@@ 2                      EXP(-X^2/2)
PI              @@@@ PI                     2             EXP(-X^2/2)
×               @@@@ PI*2                   EXP(-X^2/2)
SQRT            @@@@ SQRT(PI*2)             EXP(-X^2/2)
÷               @@@@ EXP(-X^2/2)/SQRT(PI*2) 
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:NCDF)
@@@@ DSC: Standard Normal CDF
@@@@ IN:  X: real number
@@@@ OUT: X: Standard Normal CDF value at X
@@@@ BUG: Only good to 7 decimal places
@@@@ FAQ: No dependancies, variables, loops, or branches
@@@@ REF: Zelen & Severo (1964)
@@@@ UPD: 2021-04-22
@@@@ TST: free42_3.0.2
@@@@ TC:  -2 0.02275013194817920720028
@@@@ TC:  -1 0.1586552539314570514148 
@@@@ TC:   0 0.5                      
@@@@ TC:   1 0.8413447460685429485852 
@@@@ TC:   2 0.9772498680518207927997 
LBL "NCDF"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
0.2316419       @@@@ b0                     X             ?           ?
RCL× ST Y       @@@@ b0*X                   X             ?           ?
1               @@@@ 1                      b0*X          X           ?           
+               @@@@ 1+b0*X                 X             ?           ?
1/X             @@@@ 1/(1+b0*X)             X             ?           ?
                @@@@ T                      X             ?           ?
X<>Y            @@@@ X                      T             ?           ?
X↑2             @@@@ X^2                    T             ?           ?
-2              @@@@ -2                     X^2           ?           ?
÷               @@@@ -X^2/2                 T             ?           ?
E↑X             @@@@ EXP(-X^2/2)            T             ?           ?
2               @@@@ 2                      EXP(-X^2/2)   T           ?
PI              @@@@ PI                     2             EXP(-X^2/2) T
×               @@@@ PI*2                   EXP(-X^2/2)   T           T
SQRT            @@@@ SQRT(PI*2)             EXP(-X^2/2)   T           T
÷               @@@@ EXP(-X^2/2)/SQRT(PI*2) T             T           T
                @@@@ N                      T             T           T
RCL  ST Y       @@@@ T                      N             T           T
×               @@@@ NT                     T             T           T
0.319381530     @@@@ b1                     NT            T           T
RCL× ST Y       @@@@ PR                     NT            T           T
RCL ST Z        @@@@ T                      PR            NT          T
STO× ST Z       @@@@ T                      PR            NT^2        T
R↓              @@@@ PR                     NT^2          T           T
-0.356563782    @@@@ b2                     PR            NT^2        T
RCL× ST Z       @@@@ NT                     PR            NT^2        T
+               @@@@ PR                     NT^2          T           T
RCL ST Z        @@@@ T                      PR            NT^2        T
STO× ST Z       @@@@ T                      PR            NT^3        T
R↓              @@@@ PR                     NT^3          T           T
1.781477937     @@@@ b3                     PR            NT^3        T
RCL× ST Z       @@@@ NT                     PR            NT^3        T
+               @@@@ PR                     NT^3          T           T
RCL ST Z        @@@@ T                      PR            NT^3        T
STO× ST Z       @@@@ T                      PR            NT^4        T
R↓              @@@@ PR                     NT^4          T           T
-1.821255978    @@@@ b4                     PR            NT^4        T
RCL× ST Z       @@@@ NT                     PR            NT^4        T
+               @@@@ PR                     NT^4          T           T
RCL ST Z        @@@@ T                      PR            NT^4        T
STO× ST Z       @@@@ T                      PR            NT^5        T
R↓              @@@@ PR                     NT^5          T           T
1.330274429     @@@@ b5                     PR            NT^5        T
RCL× ST Z       @@@@ NT                     PR            NT^5        T
+               @@@@ PR                     NT^5          T           T
1               @@@@ 1                      PR            NT^5        T
X<>Y            @@@@ PR                     1             NT^5        T
-               @@@@ 1-PR                   NT^5          T           T
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:ERF)
@@@@ DSC: erf (error) function
@@@@ IN:  X: real number
@@@@ OUT: X: erf(X)
@@@@ USE: NCDF
@@@@ LBL: Use: 64-65
@@@@ UPD: 2021-03-30
@@@@ TST: free42_3.0.2
@@@@ TC: -1 -0.8427007929497148693412
@@@@ TC:  0  0.0
@@@@ TC:  1  0.8427007929497148693412
@@@@ TC:  2  0.9953222650189527341621
LBL "ERF"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
ENTER
ENTER
2
SQRT
×
ABS
XEQ "NCDF"
2
×
1
-
X<>Y
X<0?
GTO 64
GTO 65
LBL 64
R↓
+/-
RTN
LBL 65
R↓
RTN

@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ (ref:ERFC)
@@@@ DSC: erfc (complementary error) function
@@@@ IN:  X: real number
@@@@ OUT: X: erfc(X)
@@@@ USE: ERF
@@@@ UPD: 2021-03-30
@@@@ TST: free42_3.0.2
@@@@ TC: -1 1.842700792949714869341
@@@@ TC:  0 1.0
@@@@ TC:  1 0.1572992070502851306588
@@@@ TC:  2 0.004677734981047265837931
LBL "ERFC"
FUNC 11         @@## REQ:free42>=2.5.24
L4STK           @@## REQ:free42>=3.0
XEQ "ERF"
1
X<>Y
-
RTN
#+END_SRC

