docs/sfun.html

<div id="outline-container-orgafb5620" class="outline-3">
<h3 id="orgafb5620"><span class="section-number-3">5.6.</span> Hyperbolic Trigonometric Functions</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-hp42s">
<span id="coderef-CSCH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CSCH)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/SINH(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"CSCH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">SINH</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-SECH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (SECH)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/COSH(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"SECH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">COSH</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-COTH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (COTH)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/TANH(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"COTH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">TANH</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ACSCH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ACSCH)</span>
<span style="color: #ffa500;">@@@@ DSC: SINH(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ACSCH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ASINH</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ASECH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ASECH)</span>
<span style="color: #ffa500;">@@@@ DSC: COSH(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ASECH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ACOSH</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ACOTH" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ACOTH)</span>
<span style="color: #ffa500;">@@@@ DSC: TANH(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ACOTH"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ATANH</span>
RTN
</pre>
</div>
</div>
</div>
