docs/sfun.html

<div id="outline-container-org534fdf5" class="outline-3">
<h3 id="org534fdf5"><span class="section-number-3">5.7.</span> Trigonometric Functions</h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-AHAV" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (AHAV)</span>
<span style="color: #ffa500;">@@@@ DSC: Inverse Haversine</span>
<span style="color: #ffa500;">@@@@ IN:  X: number</span>
<span style="color: #ffa500;">@@@@ OUT: X: ahav(X)=2*asin(sqrt(X))</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-18</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"AHAV"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">ASIN</span>
2
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-HAV" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (HAV)</span>
<span style="color: #ffa500;">@@@@ DSC: Haversine</span>
<span style="color: #ffa500;">@@@@ IN:  X: number</span>
<span style="color: #ffa500;">@@@@ OUT: X: hav(X)=1/2-cos(X)/2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-18</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"HAV"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">COS</span>
-2
<span style="color: #00ffff;">&#247;</span>
0.5
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-HYPOT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (HYPOT)</span>
<span style="color: #ffa500;">@@@@ DSC: Hypot</span>
<span style="color: #ffa500;">@@@@ IN:  Y: number</span>
<span style="color: #ffa500;">@@@@ IN:  X: number</span>
<span style="color: #ffa500;">@@@@ OUT: X: sqrt(abs(x)^2+abs(y)^2)</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"HYPOT"</span>
<span style="color: #00ffff;">FUNC</span> 21         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">COMPLEX</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-CSC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (CSC)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/SIN(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"CSC"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">SIN</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-SEC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (SEC)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/COS(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"SEC"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">COS</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-COT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (COT)</span>
<span style="color: #ffa500;">@@@@ DSC: 1/TAN(X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"COT"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">TAN</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ACSC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ACSC)</span>
<span style="color: #ffa500;">@@@@ DSC: SIN(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ACSC"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ASIN</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ASEC" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ASEC)</span>
<span style="color: #ffa500;">@@@@ DSC: COS(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ASEC"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ACOS</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ACOT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ACOT)</span>
<span style="color: #ffa500;">@@@@ DSC: TAN(1/X)</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ACOT"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ATAN2" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ATAN2)</span>
<span style="color: #ffa500;">@@@@ DSC: ATAN2</span>
<span style="color: #ffa500;">@@@@ IN:  Y: number</span>
<span style="color: #ffa500;">@@@@ IN:  X: number</span>
<span style="color: #ffa500;">@@@@ OUT: X: atan2(y, x)</span>
<span style="color: #ffa500;">@@@@ BUG: Only works in RAD mode</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ TC:  atan( 1, 1) =&gt;  pi/4     =   45&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan(-1, 1) =&gt; -pi/4     =  -45&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan( 1,-1) =&gt;  3*pi/4   =  135&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan(-1,-1) =&gt; -3*pi/4   = -135&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan( 0, 1) =&gt;  0        =    0&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan( 1, 0) =&gt;  pi       =   90&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan(-1, 0) =&gt; -pi       =  -90&#176;</span>
<span style="color: #ffa500;">@@@@ TC:  atan( 0, 0) =&gt; ERROR</span>
<span style="color: #ffa500;">@@@@ LBL: Used 59-63</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"TAN2"</span>
<span style="color: #00ffff;">FUNC</span> 21         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">X&gt;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">59</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">60</span>
<span style="color: #ffa500;">@@@@ X&lt;0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X&lt;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">61</span>
<span style="color: #ffa500;">@@@@ X&lt;0 &amp; Y&gt;=0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">PI</span>
<span style="color: #00ffff;">+</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">61</span>
<span style="color: #ffa500;">@@@@ X&lt;0 &amp; Y&lt;0</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
<span style="color: #00ffff;">PI</span>
<span style="color: #00ffff;">-</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">60</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">62</span>
<span style="color: #00ffff;">X&gt;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">63</span>
<span style="color: #ffa500;">@@@@ X=0 &amp; Y&lt;0</span>
<span style="color: #00ffff;">PI</span>
-2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">63</span>
<span style="color: #ffa500;">@@@@ X=0 &amp; Y&gt;0</span>
<span style="color: #00ffff;">PI</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">62</span>
<span style="color: #ffa500;">@@@@ X=0 &amp; Y=0 ERROR 0/0</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">59</span>
<span style="color: #ffa500;">@@@@ X&gt;0</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">ATAN</span>
RTN
</pre>
</div>
</div>
</div>
