docs/sfun.html

<div id="outline-container-orgcf1050f" class="outline-3">
<h3 id="orgcf1050f"><span class="section-number-3">5.8.</span> Logs, Powers &amp; Roots</h3>
<div class="outline-text-3" id="text-5-8">
<div class="org-src-container">
<pre class="src src-hp42s"><span id="coderef-lnYX" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (lnYX)</span>
<span style="color: #ffa500;">@@@@ DSC: Base Y Logarithm of X</span>
<span style="color: #ffa500;">@@@@ IN:  Y: logarithm base</span>
<span style="color: #ffa500;">@@@@      X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: log_y(x)</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-14</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"lnYX"</span>
<span style="color: #00ffff;">FUNC</span> 21         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-ln2" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (ln2)</span>
<span style="color: #ffa500;">@@@@ DSC: Base 2 Logarithm</span>
<span style="color: #ffa500;">@@@@ IN:  X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: log_2(x)</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"ln2"</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">LN</span>
2
<span style="color: #00ffff;">LN</span>
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Raise 2 to the power of X</span>
<span style="color: #ffa500;">@@@@ NAM: 2&#8593;X 58</span>
<span style="color: #ffa500;">@@@@ IN:  X: number or matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: 2^X</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">58</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
2
<span style="color: #00ffff;">X&lt;&gt;Y</span>
Y^X
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Square root prefering real &amp; pure imaginary answers </span>
<span style="color: #ffa500;">@@@@ NAM: ROOT2 57  </span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">57</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
2
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Cube root prefering real &amp; pure imaginary answers   </span>
<span style="color: #ffa500;">@@@@ NAM: ROOT3 56  </span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">56</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
3
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Fifth root prefering real &amp; pure imaginary answers  </span>
<span style="color: #ffa500;">@@@@ NAM: ROOT5 55  </span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">55</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
5
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span>
<span style="color: #ffa500;">@@@@ DSC: Seventh root prefering real &amp; pure imaginary answers</span>
<span style="color: #ffa500;">@@@@ NAM: ROOT7 54  </span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: root of X</span>
<span style="color: #ffa500;">@@@@ FAQ: See XYROOT for details</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-04-14</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">54</span>
<span style="color: #00ffff;">FUNC</span> 11         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
7
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #00ffff;">RTN</span>

<span id="coderef-YROOT" class="coderef-off"><span style="color: #ffa500;">@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@</span> (YROOT)</span>
<span style="color: #ffa500;">@@@@ DSC: Nth roots prefering real &amp; pure imaginary answers</span>
<span style="color: #ffa500;">@@@@ IN:  Y: Number</span>
<span style="color: #ffa500;">@@@@ IN:  X: Number or numeric matrix (element-wise)</span>
<span style="color: #ffa500;">@@@@ OUT: X: Yth root of X</span>
<span style="color: #ffa500;">@@@@ BUG: The principal value is not always returned (by design)</span>
<span style="color: #ffa500;">@@@@ BUG: Real integers are not recognized in complex form. i.e. 0+2i &#8800; 2</span>
<span style="color: #ffa500;">@@@@ FAQ: Return is pure imaginary when Y is an odd integer and X&lt;0</span>
<span style="color: #ffa500;">@@@@ FAQ: Return is real when  Y is an even integer and X&lt;0</span>
<span style="color: #ffa500;">@@@@ TST: free42_3.0.2</span>
<span style="color: #ffa500;">@@@@ UPD: 2021-02-23</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">"YROOT"</span>
<span style="color: #00ffff;">FUNC</span> 21         <span style="color: #6495ed;">@@## REQ:free42&gt;=2.5.24</span>
<span style="color: #00ffff;">L4STK</span>           <span style="color: #6495ed;">@@## REQ:free42&gt;=3.0</span>
<span style="color: #00ffff;">REAL?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">48</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">51</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">48</span>
<span style="color: #ffa500;">@@@@ X is real</span>
<span style="color: #00ffff;">X&#8805;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">51</span>
<span style="color: #ffa500;">@@@@ X is negative, real</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">REAL?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">49</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">50</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">49</span>
<span style="color: #ffa500;">@@@@ X is negative, real; Y is real</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X&#8800;0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">50</span>
<span style="color: #ffa500;">@@@@ X is negative, real; Y is real integer</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">ABS</span>
<span style="color: #00ffff;">RCL ST</span> Y
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">XEQ</span> <span style="color: #00fa9a; font-weight: bold;">51</span>
<span style="color: #00ffff;">+/-</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
2
<span style="color: #00ffff;">&#247;</span>
<span style="color: #00ffff;">FP</span>
<span style="color: #00ffff;">X=0?</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">53</span>
<span style="color: #00ffff;">GTO</span> <span style="color: #00fa9a; font-weight: bold;">52</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">53</span>
<span style="color: #ffa500;">@@@@ X is negative, real; Y is real integer even</span>
<span style="color: #00ffff;">R&#8595;</span>
-1
<span style="color: #00ffff;">SQRT</span>
<span style="color: #00ffff;">&#215;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">52</span>
<span style="color: #ffa500;">@@@@ X is negative, real; Y is real integer odd</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">RTN</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">50</span>
<span style="color: #ffa500;">@@@@ Not special case.  Stack: Y X Y</span>
<span style="color: #00ffff;">R&#8595;</span>
<span style="color: #00ffff;">LBL</span> <span style="color: #00fa9a; font-weight: bold;">51</span>
<span style="color: #ffa500;">@@@@ Not special case.  Stack: X Y</span>
<span style="color: #00ffff;">X&lt;&gt;Y</span>
<span style="color: #00ffff;">1/X</span>
<span style="color: #00ffff;">Y&#8593;X</span>
RTN
</pre>
</div>
</div>
</div>
